---
type: ClosestPointsPairBetweenTwoCurves
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# ClosestPointsPairBetweenTwoCurves

`Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ClosestPointsPairBetweenTwoCurves | — | `` |
| Constructor | ClosestPointsPairBetweenTwoCurves | 2018.1 | `public ClosestPointsPairBetweenTwoCurves ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | Distance | 2018.1 | `public double Distance { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ParameterOnFirstCurve | 2018.1 | `public double ParameterOnFirstCurve { get ; set ; }` |
| Property | ParameterOnSecondCurve | 2018.1 | `public double ParameterOnSecondCurve { get ; set ; }` |
| Property | XYZPointOnFirstCurve | 2018.1 | `public XYZ XYZPointOnFirstCurve { get ; set ; }` |
| Property | XYZPointOnSecondCurve | 2018.1 | `public XYZ XYZPointOnSecondCurve { get ; set ; }` |